package main

import (
	"encoding/json"
	"fmt"
)

func main() {
	// Создаем слайс s1 с 50 элементами
	s1 := make([]int, 50)

	// Создаем слайс s2, который ссылается на элементы s1 с индексами от 30 до 39
	s2 := s1[30:40]

	// JSON-строка, которую мы будем анмаршалить
	jsonData := `[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]`

	// Анмаршалинг JSON в s2
	if err := json.Unmarshal([]byte(jsonData), &s2); err != nil {
		fmt.Println("Ошибка анмаршалинга:", err)
	}

	// Выводим измененный слайс s1
	fmt.Println("s1 после анмаршалинга:", s1[30:40])
}

//s1 после анмаршалинга: [1 2 3 4 5 6 7 8 9 10]
