package main

import (
	"fmt"
	"sync"
	"time"
)

func main() {
	// Создаем мьютекс и условную переменную
	var mu sync.Mutex
	cond := sync.NewCond(&mu)

	// Условие, которое будут проверять горутины
	ready := false

	// Горутины, которые ждут выполнения условия
	for i := 1; i <= 3; i++ {
		go func(id int) {
			fmt.Printf("Блокируем мьютекс перед проверкой условия: %d\n", id)
			mu.Lock()
			for !ready {
				// Ожидаем, пока условие не будет выполнено
				cond.Wait()
			}
			// Условие выполнено, продолжаем выполнение
			fmt.Printf("Горутина %d продолжает выполнение\n", id)
			mu.Unlock()
		}(i)
	}

	// Симулируем выполнение какого-то условия
	time.Sleep(2 * time.Second)

	// Устанавливаем условие и уведомляем всех ждущих
	mu.Lock()
	ready = true
	cond.Broadcast() // Уведомляем всех ждущих горутин
	mu.Unlock()

	// Даем время на выполнение горутин
	time.Sleep(1 * time.Second)
}

/**
Блокируем мьютекс перед проверкой условия: 3
Блокируем мьютекс перед проверкой условия: 2
Блокируем мьютекс перед проверкой условия: 1
Горутина 1 продолжает выполнение
Горутина 3 продолжает выполнение
Горутина 2 продолжает выполнение
*/
